robingujjar/nrf51422-bootloader/my_app_uart_fifo.c
        case UART_WAIT_CLOSE:
            m_current_state = UART_ON;
            break;

        default:
            // Nothing to do.
            break;
    }
}


/**@brief Function for the handling of the ON_TX_READY event.
 */
static void on_tx_ready(void)
{
    switch (m_current_state)
    {
        case UART_WAIT_CLOSE:
            action_uart_deactivate();
            break;

        case UART_ON:
        case UART_READY:
            action_tx_ready();
            break;

        default:
            // Nothing to do.
            break;
    }
}


/**@brief Function for the handling of the ON_UART_PUT event when application has put data in the TX buffer.
 */
static void on_uart_put(void)
{
    if (m_current_state == UART_READY)
    {
        action_tx_send();
    }
}


/**@brief Function for the handling of the ON_UART_CLOSE event when application is closing the UART module.
 */
static void on_uart_close(void)
{
    action_uart_deactivate();
}


/**@brief Function for the state machine main event handler.
 *
 * @param[in]  event    Event that has occurred.
 */
static void on_uart_event(app_uart_state_events_t event)
{
    switch (event)
    {
        case ON_CTS_HIGH:
            on_cts_high();
            break;

        case ON_CTS_LOW:
            on_cts_low();
            break;

        case ON_TX_READY:
            on_tx_ready();
            break;

        case ON_UART_PUT:
            on_uart_put();
            break;

        case ON_UART_CLOSE:
            on_uart_close();
            break;

        default:
            // All valid events are handled above.
            break;
    }
}


/**@brief Function for the GPIOTE event handler.
 *
 * @param[in] event_pins_low_to_high   Mask telling which pin(s) generated an event from low->high.
 * @param[in] event_pins_high_to_low   Mask telling which pin(s) generated an event from high->low.
 */
static void gpiote_uart_event_handler(uint32_t event_pins_low_to_high,
                                      uint32_t event_pins_high_to_low)
{
    if ((event_pins_high_to_low & event_pins_low_to_high & m_pin_cts_mask) != 0)
    {
        // We have an indication from GPIOTE that the CTS pin has toggled high->low and low->high.
        // If this occurs, we must read the active pins in the GPIOTE module ourself.
        uint32_t active_pins;
        uint32_t err_code;

        err_code = app_gpiote_pins_state_get(m_gpiote_uid, &active_pins);
        if (err_code != NRF_SUCCESS)
        {
            // Pin reading was not possible, even though an event from GPIOTE was received that the
            // CTS pin toggled. If pin double toggled but status cannot be fetched we silently
            // return and keep the current UART status as-is.
            return;
        }
        event_pins_low_to_high &= active_pins;
        event_pins_high_to_low &= ~active_pins;
    }

    if ((event_pins_high_to_low & m_pin_cts_mask) != 0)
    {
        on_uart_event(ON_CTS_LOW);
    }
    else if ((event_pins_low_to_high & m_pin_cts_mask) != 0)
    {
        on_uart_event(ON_CTS_HIGH);
    }
    else
    {
        // Do nothing, as the CTS pin didn't toggle.
    }
}
extern void write_firmware_byte(uint32_t data);

void flash_write_packet(uint8_t  * p_event_message_buffer,uint8_t len){
	 uint32_t data =0;
	 uint8_t i =0;
	
	 for(i=0;i<len;i+=4){
	  data = data| (p_event_message_buffer[i+0]<<0);
	  data = data| (p_event_message_buffer[i+1]<<8);
	  data = data| (p_event_message_buffer[i+2]<<16);
	  data = data| (p_event_message_buffer[i+3]<<24);
		write_firmware_byte(data);
		data =0;
	 }
	  
	 
}

static uint32_t ram_address =0x00020000; 

//==== robin
void firmware_line(uint8_t  * p_event_message_buffer,uint8_t  mesg,  uint8_t len ){
	  uint32_t data =0;uint8_t l =0;
	  uint8_t m = 0;
		//const uint32_t message_id = p_event_message_buffer[BUFFER_INDEX_MESG_ID]; 
	  uint8_t k =0;
	  uint8_t addedlen = 4+len;
   
		uint8_t  buf[48];
		//uint32_t nw;
		int i;
		uint8_t chk = 0xa4;
	
	  data = data| (p_event_message_buffer[0]<<0);
	  data = data| (p_event_message_buffer[1]<<8);
	  data = data| (p_event_message_buffer[2]<<16);
	  data = data| (p_event_message_buffer[3]<<24);
	  //ram_address+=4;
  	//printf("write_firmware_byte %08x\r\n",data);
	  write_firmware_byte(data);
	  //*ram_address = data;
    //ram_address++;	
	   
	 
	
	/* for(l=0;l<len;l+=4){
	  data = data| (p_event_message_buffer[l+0]<<0);
	  data = data| (p_event_message_buffer[l+1]<<8);
	  data = data| (p_event_message_buffer[l+2]<<16);
	  data = data| (p_event_message_buffer[l+3]<<24);
		write_firmware_byte(data);
		data =0;
	 }*/
    
    return;
	 
		buf[0] = 0xa4;
		buf[1] = addedlen; chk ^= addedlen;
		buf[2] = mesg; chk ^= mesg;
		for (i = 0; i < len; i++) {
			buf[3+i] = p_event_message_buffer[i];
			chk ^= p_event_message_buffer[i];
		}
		buf[3+i] = chk;
		
		for(m=0;m<24;m++){
			p_event_message_buffer[m]=0;
		}
			
		
		int j=0;
		
		for(j=0;j<4+len;j++){
			  
			 //printf("\n %02x \n\r",p_event_message_buffer[j]);
			 app_uart_put(buf[j]);	
			  for(k=0;k<100;k++);	
			  
		}

}



void new_uartreader_send_response(uint8_t rsp ){
	  uint8_t k =0;
	  uint16_t deviceNumber =0 ; uint8_t deviceType = 0;uint8_t transType =rsp;
	  uint8_t addedlen = 4+4;
		uint8_t  buf[30];
		uint8_t chk = 0xA4;
	   

		buf[0] = 0xA4;
		buf[1] = addedlen; chk ^= addedlen;
		buf[2] = 0x50; chk ^= 0x50;
		
		buf[3+0] = deviceNumber;
		chk ^= deviceNumber;
	
	  buf[3+1] = (deviceNumber>>8);
		chk ^= (deviceNumber>>8);
	  
	  buf[3+2] = deviceType;
		chk ^= deviceType;
	  
	  buf[3+3] = transType;
		chk ^= transType;

		buf[3+4] = chk;
		int j=0;
		for(j=0;j<8;j++){ 
			 
			 app_uart_put(buf[j]);	
			  //nrf_delay_us(1000);
         for(k=0;k<100;k++);			
		}
}

void uartreader_send_response(uartreader_response_t rsp)
{
		NRF_UART0->TXD = (uint8_t) rsp;

		NRF_UART0->TASKS_STARTTX = 1;
}

extern uartreader_response_t write_line(uartreader_evt_t * evt);
extern void erase_app(void);

void uart_handler(uartreader_evt_t * evt)
{
    //uartreader_response_t result;
	  uint8_t no_of_pages =0; 
	    
    switch (evt->cmd)
    {
        case REST_SYSTEM:
					   
             
            uartreader_send_response((uartreader_response_t)0x4a);
				    //SD_NVIC_SYSTEMRESET 
            break;

        case SET_NETWORK_KEY:
					  //ret = ANT_SetNetworkKeya(uint8_t net, uint8_t*key);
					  //printf("\n SET_NETWORK_KEY ");
            //result = 0;//write_line(evt);
            
