robingujjar/nrf51422-bootloader/my_app_uart_fifo.c
				    uartreader_send_response((uartreader_response_t)0x46);
            break;

        case ASSIGN_CHANNEL:
					
						
					  
            uartreader_send_response((uartreader_response_t)0x42);           
            break;

        
				case SET_CHANNEL_PERIOD:					
					    
					  //printf("\n SET_MESSAGE_PERIOD ");
            uartreader_send_response((uartreader_response_t)0x43);            
            break;
				
				case SET_RF_FREQ:					
					  
					  //printf("\n SET_RF_FREQ ");
            uartreader_send_response((uartreader_response_t)0x45);
            
            break;
				case OPEN_CHANNEL:					
						  
					  //printf("\n OPEN_CHANNEL ");
            uartreader_send_response((uartreader_response_t)0x89);

            
            break;
			 case NOP:
            uartreader_send_response((uartreader_response_t)0xEE);
            
            break;
			 case MESG_SENSOR_TYPE:
				      
			      uartreader_send_response((uartreader_response_t)0x82);
						break;
			 case MESG_CHANNEL_CLOSE_ID:
			      //ret =ANT_RequestMessage(evt->data[3], MESG_CHANNEL_CLOSE_ID);
			        
				    uartreader_send_response((uartreader_response_t)0x4c);
			       
			      
				    break;
			 
			 case MESG_FIRMWARE_HEX_LINE:	
             //write_line(evt);				 
			       firmware_line(&evt->data[3],0x91,evt->data[1]);			      
			      break;			 
			 case MESG_ERASE_APP:
				    no_of_pages = *(&evt->data[3]);
            //nrf51422_erase_app(no_of_pages);
			      ANT_RequestMessage(*(&evt->data[3]),MESG_ERASE_APP);
            
            break;
        case MESG_RESET_AND_RUN:
             //uartreader_send_response((uartreader_response_t)0x93);
				     ANT_RequestMessage(*(&evt->data[3]),MESG_RESET_AND_RUN);
				     
            break;
			 
			 default :
				    //printf("\nJMD ");
				    uartreader_send_response((uartreader_response_t)0xFF);
			     break;
    }
}

static uint8_t m_buffer_index = 0;
static uartreader_handler_t m_evt_handler =uart_handler;
static uartreader_evt_t m_evt;
static uint32_t this_msg_len =0;
static uint8_t  crc;

void command_handler_from_stm32xx(uint8_t ch){
		
			if(m_buffer_index==0){ //start of the message 
					if(ch==0xa4){ //first char  should be a4.
						 
							 m_evt.data[m_buffer_index] = ch;
               m_buffer_index++;
							 ch=0;	
							 crc = 0xa4;					 
						}
			}else{
              m_evt.data[m_buffer_index] = ch;
              crc ^= m_evt.data[m_buffer_index];
							if(m_buffer_index == 1 ){  //this is length byte
								 this_msg_len = m_evt.data[m_buffer_index];
							}
							if(m_buffer_index == 2){ //this is command byte
								 m_evt.cmd = (uartreader_cmd_t)m_evt.data[m_buffer_index];
							}	
							if( m_buffer_index >= UARTREADER_MAX_LEN-1  //this is for a max value case 
							            || m_buffer_index >= this_msg_len+3 ){   //this is what is working now.
										if(crc !=0){				
											printf("address %08x crc error %02x\r\n",ram_address,crc);
											printf("m_evt.data[0] %02x\r\n",m_evt.data[0]);
											printf("m_evt.data[1] %02x\r\n",m_evt.data[1]);
											printf("m_evt.data[2] %02x\r\n",m_evt.data[2]);
											printf("m_evt.data[3] %02x\r\n",m_evt.data[3]);
											printf("m_evt.data[4] %02x\r\n",m_evt.data[4]);
											printf("m_evt.data[5] %02x\r\n",m_evt.data[5]);
											printf("m_evt.data[6] %02x\r\n",m_evt.data[6]);
											printf("m_evt.data[7] %02x\r\n",m_evt.data[7]);
										}			 
                  m_evt.len = m_buffer_index-1;
                  m_evt_handler(&m_evt);  //jump to main command handler 
                  m_buffer_index = 0;  //clear index
								  this_msg_len =0;    //clear length
							}else{
                m_buffer_index++;
							}
			}
      //jmd --<<
}
//==== robin end 
static uint16_t                    m_rx_byte = 0xFFFF;
/**@brief Function for the UART Interrupt handler.
 *
 * @details UART interrupt handler to process TX Ready when TXD is available, RX Ready when a byte
 *          is received, or in case of error when receiving a byte.
 */
void UART0_IRQHandler(void)
{
    // Handle reception
    if (NRF_UART0->EVENTS_RXDRDY != 0)
    {
        uint32_t err_code;
        
        // Clear UART RX event flag
        NRF_UART0->EVENTS_RXDRDY = 0;
			
			  m_rx_byte  = (uint8_t)NRF_UART0->RXD;
		    command_handler_from_stm32xx(m_rx_byte);
        
        // Write received byte to FIFO
        //err_code = app_fifo_put(&m_rx_fifo, (uint8_t)NRF_UART0->RXD);
			  err_code = app_fifo_put(&m_rx_fifo, m_rx_byte);
        if (err_code != NRF_SUCCESS)
        {
            app_uart_evt_t app_uart_event;
            app_uart_event.evt_type          = APP_UART_FIFO_ERROR;
            app_uart_event.data.error_code   = err_code;
            //m_event_handler(&app_uart_event);
        }
        // Notify that new data is available if this was first byte put in the buffer.
        else if (FIFO_LENGTH(m_rx_fifo) == 1)
        {
            app_uart_evt_t app_uart_event;
            app_uart_event.evt_type = APP_UART_DATA_READY;
            //m_event_handler(&app_uart_event);
        }
        else
        {
            // Do nothing, only send event if first byte was added or overflow in FIFO occurred.
        }
    }
    
    // Handle transmission.
    if (NRF_UART0->EVENTS_TXDRDY != 0)
    {
        // Clear UART TX event flag.
        NRF_UART0->EVENTS_TXDRDY = 0;
        on_uart_event(ON_TX_READY);
    }
    
    // Handle errors.
    if (NRF_UART0->EVENTS_ERROR != 0)
    {
        uint32_t       error_source;
        app_uart_evt_t app_uart_event;

        // Clear UART ERROR event flag.
        NRF_UART0->EVENTS_ERROR = 0;
        
        // Clear error source.
        error_source        = NRF_UART0->ERRORSRC;
        NRF_UART0->ERRORSRC = error_source;

        app_uart_event.evt_type                 = APP_UART_COMMUNICATION_ERROR;
        app_uart_event.data.error_communication = error_source;

        m_event_handler(&app_uart_event);
    }
}


/**@brief Function for initialization of UART when flow control is disabled.
 */
static void uart_no_flow_control_init(void)
{
    NRF_UART0->ENABLE        = (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos);
    NRF_UART0->EVENTS_RXDRDY = 0;
    NRF_UART0->EVENTS_TXDRDY = 0;

    NRF_UART0->CONFIG       &= ~(UART_CONFIG_HWFC_Enabled << UART_CONFIG_HWFC_Pos);

    NRF_UART0->PSELRTS       = UART_PIN_DISCONNECTED;
    NRF_UART0->PSELCTS       = UART_PIN_DISCONNECTED;

